In [38]:
import pandas as pd
import numpy as np
import hvplot.pandas

In [39]:
df = pd.read_csv('./data/names_df.csv')
df.head()

            Name Sex   Number   Year
0       --Mary--   F  L007065  Y1880
1       --Anna--   F  L002604  Y1880
2       --Emma--   F  L002003  Y1880
3  --Elizabeth--   F  L001939  Y1880
4     --Minnie--   F  L001746  Y1880

In [40]:
df['Name'] = df.Name.str.strip('--')
df['Number'] = df.Number.str.strip('L00').astype(np.int)
df['Year'] = df.Year.str.strip('Y').astype(np.int)
# 'Female' == 0, 'Male' == 1
#df['Sex'] = df.Sex.apply(lambda x: 0 if x=='F' else 1)

In [41]:
df.groupby(['Year', 'Sex']).count().head()

          Name  Number
Year Sex
88   F       1       1
1880 F     942     942
     M    1058    1058
1881 F     938     938
     M     997     997

In [42]:
df[df.Year == 88]

       Name Sex  Number  Year
17502  Mary   F   11754    88

In [43]:
idx = df[df.Year == 88].index[0]
df.at[idx-1, 'Year'], df.at[idx+1, 'Year']

(1887, 1888)

In [44]:
samp = df[df.Year == 1888]
samp[samp.Name == 'Mary']

       Name Sex  Number  Year
19223  Mary   M       5  1888

In [45]:
df.at[idx, 'Year'] = 1888

In [46]:
grouped = df.groupby(['Year', 'Sex']).count()

In [47]:
grouped.head()

          Name  Number
Year Sex
1880 F     942     942
     M    1058    1058
1881 F     938     938
     M     997     997
1882 F    1028    1028

In [48]:
df.groupby(['Year', 'Sex']).count().head()

          Name  Number
Year Sex
1880 F     942     942
     M    1058    1058
1881 F     938     938
     M     997     997
1882 F    1028    1028

In [93]:
grouped = df.groupby(['Name', 'Sex'], as_index = False).sum()
grouped.head()

        Name Sex  Number   Year
0      Aaban   M     107  20124
1      Aabha   F      35  10068
2      Aabid   M      10   4019
3      Aabir   M       5   2016
4  Aabriella   F      32  10070

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1924665 entries, 0 to 1924664
Data columns (total 4 columns):
Name      object
Sex       object
Number    int64
Year      int64
dtypes: int64(2), object(2)
memory usage: 58.7+ MB

In [50]:
df.head()

        Name Sex  Number  Year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

### Most common names
1.	What was the most common male name in 1989?

In [185]:
df[(df.Year == 1989) & (df.Sex == 'M')].iloc[0, :].Name

'Michael'

2.	What was the most common female name in 1989?

In [186]:
df[(df.Year == 1989) & (df.Sex == 'F')].iloc[0, :].Name

'Jessica'

3.	Write code to output a list of the most common male names by year.

In [126]:
def most_common_male_names(year, n=10):
    s = df[(df.Year == int(year)) & (df.Sex == 'M')].Name[:n]
    return list(s)

In [128]:
most_common_male_names(1990, 15)

['Michael',
 'Christopher',
 'Matthew',
 'Joshua',
 'Daniel',
 'David',
 'Andrew',
 'James',
 'Justin',
 'Joseph',
 'Ryan',
 'John',
 'Robert',
 'Nicholas',
 'Anthony']

4.	Write code to output a list of the most common female names by year.

In [129]:
def most_common_female_names(year, n=10):
    s = df[(df.Year == int(year)) & (df.Sex == 'F')].Name[:n]
    return list(s)

In [132]:
most_common_female_names(1994)

['Jessica',
 'Ashley',
 'Emily',
 'Samantha',
 'Sarah',
 'Taylor',
 'Brittany',
 'Amanda',
 'Elizabeth',
 'Megan']

### Name diversity
5.	How many unique names are there in the entire dataset?

In [134]:
df.Name.nunique()

97311

6.	How many unique male names were there in 1989?

In [138]:
df[(df.Year == 1989) & (df.Sex == 'M')].Name.nunique()

9227

7.	How many unique female names were there in 1989?

In [139]:
df[(df.Year == 1989) & (df.Sex == 'F')].Name.nunique()

14546

8.	How many unique names (male and female) were there in 1989?

In [142]:
df[(df.Year == 1989)].Name.nunique()

21621

9.	Why is the number of unique names in 1989 (problem #8) smaller than the sum of unique male names (problem #6) and unique female names (problem #7) for that year?

In [187]:
M89 = df[(df.Year == 1989) & (df.Sex == 'M')].Name
F89 = df[(df.Year == 1989) & (df.Sex == 'F')].Name
T89 = df[(df.Year == 1989)].Name

print('Unique Names - M+F: ', M89.nunique() + F89.nunique(), '\n' + 'Unique Names - All: ', T89.nunique())

Unique Names - M+F:  23773
Unique Names - All:  21621

In [184]:
common_names = (set(M89) & set(F89) & set(T89))
print(len(common_names))
print(list(common_names)[:12])

2152
['Jami', 'Dominick', 'Beryl', 'Monet', 'Simeon', 'Nova', 'Kelby', 'Christen', 'Hayden', 'Whitley', 'Antonia', 'Natale']

Some males and females born in 1989 share the same names.

10.	Write code to output a list of names that show up in both the male and female groups in 1989. How many names show up in both groups for that year?

In [51]:
def gender_neutral_names(year=1989):
    M89 = df[(df.Year == year) & (df.Sex == 'M')].Name
    F89 = df[(df.Year == year) & (df.Sex == 'F')].Name
    names = list(set(M89) & set(F89))
    return names

In [52]:
n = gender_neutral_names(1989)
len(n)

2152

11.	Show how the answer to problem #10 helps explain the answer to problem #9.

In [201]:
common_names = (set(M89) & set(F89) & set(T89))
print(len(common_names))
print(list(common_names)[:12])

2152
['Jami', 'Dominick', 'Beryl', 'Monet', 'Simeon', 'Nova', 'Kelby', 'Christen', 'Hayden', 'Whitley', 'Antonia', 'Natale']

### Unisex names
12.	Provide a list of the most common unisex names through 2017. Describe and justify your criteria for a name to be considered unisex. What other criteria could you use for a name to be unisex?

In [94]:
from collections import Counter
countr = Counter()

for year in df.Year.unique():
    names = gender_neutral_names(year)
    for name in names:
        countr[name] += 1

In [97]:
countr.most_common(25)

[('William', 138),
 ('Marion', 138),
 ('Ollie', 138),
 ('Francis', 138),
 ('Johnnie', 138),
 ('Sidney', 138),
 ('Jesse', 138),
 ('Lee', 138),
 ('Tommie', 138),
 ('Jessie', 138),
 ('Joseph', 138),
 ('Leslie', 138),
 ('Jean', 138),
 ('James', 138),
 ('June', 137),
 ('Elizabeth', 137),
 ('John', 137),
 ('Henry', 137),
 ('Charles', 137),
 ('Charlie', 137),
 ('Thomas', 136),
 ('Robert', 136),
 ('Ira', 136),
 ('Sammie', 135),
 ('Cleo', 135)]

In [53]:
df.head()

        Name Sex  Number  Year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

In [99]:
f = df[df.Sex == 'F']
m = df[df.Sex == 'M']

In [132]:
ff = Counter(f.Name.apply(lambda x: x[0]))
fl = Counter(f.Name.apply(lambda x: x[-1]))
ffl = Counter(f.Name.apply(lambda x: x[0] + x[-1]))

In [133]:
mf = Counter(m.Name.apply(lambda x: x[0]))
ml = Counter(m.Name.apply(lambda x: x[-1]))
mfl = Counter(m.Name.apply(lambda x: x[0] + x[-1]))

In [138]:
list(zip([i[0] for i in ffl.most_common(15)], [i[0] for i in mfl.most_common(15)]))

[('Aa', 'Dn'),
 ('La', 'Jn'),
 ('Sa', 'Kn'),
 ('Ma', 'An'),
 ('Ta', 'Cn'),
 ('Da', 'Tn'),
 ('Ca', 'Bn'),
 ('Ka', 'Sn'),
 ('Me', 'Ln'),
 ('Je', 'Je'),
 ('Ce', 'De'),
 ('Ja', 'Rn'),
 ('Ae', 'En'),
 ('Ra', 'Mn'),
 ('Ea', 'Ce')]

In [139]:
from sklearn.model_selection import train_test_split

              Name Sex  Number  Year
0             Mary   F    7065  1880
1             Anna   F    2604  1880
2             Emma   F    2003  1880
3        Elizabeth   F    1939  1880
4           Minnie   F    1746  1880
5         Margaret   F    1578  1880
6              Ida   F    1472  1880
7            Alice   F    1414  1880
8           Bertha   F     132  1880
9            Sarah   F    1288  1880
10           Annie   F    1258  1880
11           Clara   F    1226  1880
12            Ella   F    1156  1880
13        Florence   F    1063  1880
14            Cora   F    1045  1880
15          Martha   F     104  1880
16           Laura   F    1012  1880
17          Nellie   F     995  1880
18           Grace   F     982  1880
19          Carrie   F     949  1880
20           Maude   F     858  1880
21           Mabel   F     808  1880
22          Bessie   F     796  1880
23          Jennie   F     793  1880
24        Gertrude   F     787  1880
25           Julia   F     783  1880
26          Hattie   F     769  1880
27           Edith   F     768  1880
28          Mattie   F     704  1880
29            Rose   F       7  1880
...            ...  ..     ...   ...
1910475         Zi   F       5  2017
1910476      Ziham   F       5  2017
1910477      Zikra   F       5  2017
1910478    Zinaida   F       5  2017
1910479       Zing   F       5  2017
1910480    Ziniyah   F       5  2017
1910481     Zionah   F       5  2017
1910482      Zirwa   F       5  2017
1910483      Ziyue   F       5  2017
1910484       Zoeh   F       5  2017
1910485      Zoeii   F       5  2017
1910486  Zoeygrace   F       5  2017
1910487   Zoeyjane   F       5  2017
1910488      Zohet   F       5  2017
1910489      Zolah   F       5  2017
1910490   Zorianna   F       5  2017
1910491    Zorriah   F       5  2017
1910492    Zoryana   F       5  2017
1910493    Zubaida   F       5  2017
1910494      Zuhra   F       5  2017
1910495    Zuleima   F       5  2017
1910496    Zuliana   F       5  2017
1910497      Zulmy   F       5  2017
1910498    Zyannah   F       5  2017
1910499     Zyiana   F       5  2017
1910500    Zyianna   F       5  2017
1910501     Zykira   F       5  2017
1910502      Zymia   F       5  2017
1910503      Zynia   F       5  2017
1910504      Zyonn   F       5  2017

[1138293 rows x 4 columns]

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1924665 entries, 0 to 1924664
Data columns (total 4 columns):
Name      object
Sex       object
Number    object
Year      object
dtypes: object(4)
memory usage: 58.7+ MB

In [15]:
import dask.dataframe as dd

df = dd.read_csv('./data/names_df.csv')

In [17]:
df.info()

<class 'dask.dataframe.core.DataFrame'>
Columns: 4 entries, Name to Year
dtypes: object(4)

## Machine learning exercise

Design and create a machine learning model that classifies a name as either male or female based on the characteristics of the name. Write up a report with screenshots in a text document or Jupyter notebook that describes the following:

â€¢	the input data and its quality

â€¢	any data exploration and any interesting insights

â€¢	any preprocessing or cleaning of the data that was needed, including how you chose to label the data (i.e., how you labeled a name male or female as the ground truth for the model)

â€¢	the features used by your model and why you chose them

â€¢	your selection of machine learning algorithm and why it was chosen

â€¢	the accuracy of your model and any relevant metrics that describe model performance

â€¢	any model parameter tuning used to improve performance

â€¢	any relevant discussion, model interpretation, future steps, or further exploration needed

In addition, prepare a short slideshow presentation (~10 min.) of an overview of the machine learning exercise. You will present this to the analytics team.
There are no restrictions on the classification model that you use; however, be sure to keep in mind your ability to adequately explain and interpret the results.
Good luck!